In [1]:
import sqlite3
import pandas as pd

conn = sqlite3.connect(r"C:\Users\ayojo\Desktop\ALTSCHOOL\Third Semester\Project\chinook.db")

# Finding Customer Lifetime Value and Identifying top customers based off their orders
query = """ SELECT 
    c.CustomerId, 
    c.FirstName || ', ' || c.LastName AS CustomerName, 
    SUM(ii.UnitPrice * ii.Quantity) AS LifetimeValue
FROM 
    customers c
JOIN 
    invoices i ON c.CustomerId = i.CustomerId
JOIN 
    invoice_items ii ON i.InvoiceId = ii.InvoiceId
GROUP BY 
    c.CustomerId
ORDER BY 
    LifetimeValue DESC;
"""

# Load the data into a pandas dataframe
CLV = pd.read_sql(query, conn)

# Call the dataframe to Power BI to generate output
CLV.head()

   CustomerId         CustomerName  LifetimeValue
0           6         Helena, Holý          49.62
1          26  Richard, Cunningham          47.62
2          57          Luis, Rojas          46.62
3          45     Ladislav, Kovács          45.62
4          46       Hugh, O'Reilly          45.62